Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཉུང་ཟད་ཉི་ཚེ་ཞིག་གི་ཆེད་དུ་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ནི་མ་ཡིན་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱང་དེ་དག་ལ་འགོད་པར་བྱའོ་ཞེས་བྱ་བ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ་ཞེས་བྱ་བའི་བར་གྱིས་བསྟན་ཏོ།
en: Among them, the vast intention is taught from where it says they “do not practice for awakening for a partial number of beings,” and ‘I have to establish all beings in those perfections,’ up to, “Venerable Śāriputra, they are therefore said to be ‘armed with great armor.’ ”

source: །སྒྲུབ་པ་རྒྱ་ཆེ་བ་ནི་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ན་ཞེས་བྱ་བ་ནས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གཅིག་ལ་གཅིག་སྦྱོར་བས་ཕྱོགས་བཅུའི་སངས་རྒྱས་རྣམས་ཀྱང་ཆེད་དུ་གླེང་ཞིང་མིང་ཡོངས་སུ་བསྒྲགས་པ་མཛད་པའི་བར་གྱིས་བཤད་དོ།
en: The explanation of the vast practice is from “furthermore, Venerable Śāriputra, bodhisattva great beings practicing the perfection of wisdom give a gift,” and so on, up to where each of the six perfections is connected with the others so that the buddhas standing in the ten directions also “cry out cries of delight and proclaim the name.” “

source: །ཉུང་ཟད་ཉི་ཚེ་ཞིག་གི་ཕྱིར་མ་ཡིན་ཞེས་བྱ་བ་ནི་ཡུལ་ཡོངས་སུ་ཆད་པ་མེད་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ། ཡུལ་ཡོངས་སུ་ཆད་པ་མེད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་ཆད་པ་མེད་པ་དང་། སྦྱོར་བ་ཡོངས་སུ་ཆད་པ་མེད་པ་གསུམ་གྱིས་བསམ་པ་རྒྱ་ཆེ་བ་བསྟན་ཏོ།
en: Not… for a partial number of beings” means “an object has not been carved out,” so the vast intention is explained in terms of these three: an object has not been carved out, a being has not been carved out, and a practice has not been carved out.

source: །སྒྲུབ་པ་རྒྱ་ཆེ་བ་ལས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆའོ་ཞེས་བྱ་བ་ནི་རང་བཞིན་གྱིས་ཟང་ཟིང་གི་སྦྱིན་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: From the vast practice, the practice of the perfection of giving “is the perfection of giving armor.” The basic giving of material things is the perfection of giving.

source: དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་པའི་ཕྱིར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཡོངས་སུ་བསྔོས་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་ཞེས་བྱའོ།
en: It is called “perfection of giving armor” because it has been “made… into something shared in common by all beings” and dedicated “to unsurpassed, perfect, complete awakening” and the welfare of all beings.

source: །དེ་བཞིན་དུ་ཟང་ཟིང་གི་སྦྱིན་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ལ། དེ་ལ་སྤྱོད་པ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བྱེད་པ་དང་མི་ལྡན་པ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་ཞེས་བྱ་སྟེ། འདི་ལྟར་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལ། དེ་ནས་ཡི་དམ་བླངས་པ་སྟེ།
en: Similarly, the giving of material things is the perfection of giving, and when it is practiced “with attention not connected with śrāvakas and pratyekabuddhas… it is perfection of morality armor” because, having produced the thought of perfect, complete awakening and taken the vow, giving it up is contrary to morality.

source: ཡོངས་སུ་གཏོང་བ་ནི་ཚུལ་ཁྲིམས་དང་འགལ་བའི་ཕྱིར་རོ། །དེ་བཞིན་དུ་ཟང་ཟིང་གི་སྦྱིན་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ལ།
en: Similarly, the giving of material things is the perfection of giving.

source: དེ་ལ་བརྩོན་པ་ནི་སྦྱིན་པར་བྱ་བ་དང་། སྦྱིན་པ་པོ་དང་། ལེན་པ་པོ་མི་དམིགས་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་ལ་བཟོད་པའི་དོན་ནི་ཆོས་ལ་ངེས་པར་སེམས་པའི་བཟོད་པ་སྟེ། བཟོད་པའི་གོ་ཆ་ཞེས་བྱའོ།
en: Working hard at that, the “forbearance for” definitive meditation on “phenomena,” the reality of patience when paying attention to a gift, a giver, and a recipient that cannot be apprehended is “the perfection of patience armor.”

source: །དེ་བཞིན་དུ་སྦྱིན་པ་གཏོང་བ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་ལ་བརྩོན་འགྲུས་མངོན་པར་འཕེལ་བ་ནི་བརྩོན་འགྲུས་ཀྱི་གོ་ཆའོ།
en: Similarly, when giving gifts, the intensification of perseverance at giving dedicated to the welfare of all beings is “the perfection of perseverance armor.”

source: །དེ་བཞིན་དུ་སྦྱིན་པ་གཏོང་བ་ན་སྦྱིན་པའི་གནས་སྐབས་དང་། ཡོངས་སུ་བསྔོ་བའི་གནས་སྐབས་ན་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ། སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པ་ནི་བསམ་གཏན་གྱི་གོ་ཆའོ།
en: Similarly, when giving gifts, be it during the period of giving or during the period of dedication, a mind one-pointedly focused on attention to the knowledge of all aspects is “the perfection of concentration armor.” “

source: །དེ་གཅིག་པུ་ལ་དམིགས་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་གཅིག་པུ་ཁོ་ན་ལ་དམིགས་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Have only that as their focus” means it has only the knowledge of all aspects as its focus.

source: །དེ་བཞིན་དུ་སྦྱིན་པ་གཏོང་བ་ན་སྒྱུ་མ་ལྟ་བུ་ལ་སོགས་པར་ཡིད་ལ་བྱེད་པ་རྣམས་དང་། རྣམ་པར་མི་རྟོག་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་མི་སྤོང་བ་དང་། ཀུན་རྫོབ་ཡོངས་སུ་མ་བཏང་བས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་དང་། དོན་དམ་པ་ཡོངས་སུ་མ་བཏང་བས་དམིགས་སུ་མེད་པའི་སྦྱོར་བའི་ཡིད་ལ་བྱེད་པ་ནི་ཤེས་རབ་ཀྱི་གོ་ཆའོ།
en: Similarly, when giving gifts, paying attention to not stopping attention to things being like illusions and so on, and attention to the absence of thought constructions—paying attention to not forsaking the conventional dedication to awakening and not forsaking the ultimate practice that cannot be apprehended—is “perfection of wisdom armor.”

source: །དེ་བཞིན་དུ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ན་མི་དམིགས་པར་སྦྱོར་བའི་ཡིད་ལ་བྱེད་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འདོད་ཀྱང་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་མཚན་མ་རྣམས་མི་དམིགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱེད་པ་ལ་ཞུགས་ཀྱང་མཚན་མ་དེ་མི་དམིགས་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ཡང་བྱང་ཆུབ་ཀྱི་མཚན་མ་མི་དམིགས་པ་སྟེ། དེ་ལྟར་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཡིད་ལ་བྱེད་པ་འདི་ནི་དོན་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གིས་ཡོངས་སུ་ཟིན་པའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་གོ་ཆ་ཞེས་བྱའོ།
en: Similarly, when giving gifts, still wanting to fulfill the six perfections through attention to the practice of not apprehending anything, also not apprehending the causal signs of giving, morality, patience, perseverance, concentration and wisdom; having set out to make that into something shared in common, not apprehending the causal sign even of that; and dedicating it to perfect, complete awakening but not apprehending the causal sign even of awakening—this attention to not apprehending the causal signs of all dharmas is “the six perfections armor,” because it has been aided by the six ultimate perfections.

source: །དོན་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་བསྟན་པ་ཉིད་ཀྱི་ཕྱིར་དེ་དག་སོ་སོར་བསྟན་ཏོ།
en: In order to teach just those six ultimate perfections each has been taught separately.

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་བསྲུང་བ་ན་ཚུལ་ཁྲིམས་དང་རྗེས་སུ་མཐུན་པར་བྱ་བ་ཉིད་ཀྱི་ཕྱིར། སྦྱིན་པ་གཏོང་བ་དང་། ཚུལ་ཁྲིམས་དང་རྗེས་སུ་མཐུན་པའི་བསམ་པས་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་སྦྱིན་པའི་གོ་ཆ་ཞེས་བྱའོ་ཞེས་བྱ་བ་དང་།
en: Furthermore, when bodhisattvas guard morality, and, because it will be in accord with that morality, give gifts, and with an intention in accord with that morality make it into something shared in common and dedicate it to awakening, that practice of the perfection of morality is called “giving armor.”

source: དེ་བཞིན་དུ་བཟོད་པ་དང་རྗེས་སུ་མཐུན་པའི་བསམ་པས་སྦྱིན་པ་ལ་སོགས་པ་བྱེད་པ་དང་། བརྩོན་འགྲུས་དང་རྗེས་སུ་མཐུན་པར་བྱ་བ་ཉིད་དང་། བསམ་གཏན་གྱི་རྗེས་སུ་མཐུན་པར་བྱ་བ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བར་ཐམས་ཅད་ལ་སྦྱར་བར་བྱའོ།
en: Similarly, connect “doing the giving and so on with an intention in accord with patience, and because it will be in accord with perseverance, and because it will be in accord with concentration” with them all.

source: །སེར་སྣ་དང་འཆལ་བའི་ཚུལ་ཁྲིམས་དང་། གནོད་སེམས་ལ་སོགས་པ་མི་མཐུན་པའི་ཕྱོགས་སུ་གྱུར་པའི་ཉོན་མོངས་པ་རྣམས་ཚར་བཅད་པ་དང་། རྗེས་སུ་མཐུན་པ་ཉིད་དུ་ཞེས་བྱ་བ་ལ་སོགས་པ་སྟེ། དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Connect “being in accord with eliminating such opposing-side afflictions as miserliness, immorality, animosity” and so on with all the perfections as well.

source: ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན།
en: How have they set out in the Great Vehicle?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་གང་ཡིན་ཞེས་བྱ་བ་གསུངས་སོ།
en: To pose the second question, it says, “Venerable Pūrṇa, to what extent have bodhisattva great beings set out in a great vehicle, and what is the bodhisattva great beings’ Great Vehicle?”

source: །དེ་སྐད་གསུངས་པ་དང་། གནས་བརྟན་གང་པོས་ཐེག་པ་ཆེན་པོ་རྣམ་པ་བཅུ་དང་། དེ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམ་པ་བཅུ་བསྟན་ནས། དེ་བས་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་བསྟན་ཏོ།
en: Having said that, elder Pūrṇa, having taught a tenfold great vehicle and setting out in a great vehicle tenfold, then says “in that way… [they] have set out in the Great Vehicle.”

source: །དེ་ལ་སྔར་གཟུགས་ཀྱི་བསམ་གཏན་བཞི་དང་ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། ཆོས་བཅུ་གཉིས་པོ་དེ་དག་དང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བསྒོམས་ན་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། དེ་དག་གི་རྣམ་པ་དང་། རྟགས་དང་མཚན་མ་ཡིད་ལ་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་ནི་ཐེག་པ་ཆེན་པོ་དེ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བསྟན་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ཡིན་ཏེ།
en: There, having first taught that when they meditate on the four form concentrations, the four immeasurables, the four formless absorptions, and those twelve dharmas and the six perfections it is a great vehicle, and when they “pay attention to the attributes, tokens, and signs” of those, make them into something shared in common, and grow them into awakening that they have set out in the Great Vehicle, it sums up in conclusion with, “That, Venerable Śāriputra, is the bodhisattva great beings’ Great Vehicle, and in that way bodhisattva great beings have set out in the Great Vehicle.”

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཞེས་བྱའོ་ཞེས་བྱ་བས་མཇུག་བསྡུས་སོ། །དེ་ནས་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། ཆོས་བཅུ་གཉིས་པོ་དེ་དག་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱས་ན་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། མདོ་ལས་འབྱུང་བ་བཞིན་དུ་དེ་ལ་བརྩོན་པ་ཡང་དག་པར་ཞུགས་པ་ཡིན་པར་བསྟན་པའི་ཕྱིར།
en: Then, the second also teaches them, in order to teach that when those same six perfections and those twelve have been made complete it is the Great Vehicle, and that those working hard at those as explained in the Sūtra are those who have set out.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ཐེག་པ་ཆེན་པོ་ཡིན་ཏེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་གཉིས་པ་དེ་དག་བསྟན་པའོ།
en: Thus it says, “That, Venerable Śāriputra, is the bodhisattva great beings’ Great Vehicle that is the six perfections, and in that way bodhisattva great beings have set out in the Great Vehicle.”

source: །སྦྱིན་པ་ཞེས་བྱ་བ་ནི། འདིར་ཆོས་ཀྱི་སྦྱིན་པ་ལ་བྱ་སྟེ། དེ་ཡང་རྣམ་པ་ཐམས་ཅད་དུ་བསྒོམས་ན། དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཐར་ཐུག་པའི་བར་གྱི་ཆོས་རྣམས་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་།
en: Take the “giving” here as the gift of the dharmas, so, again, when meditated on in all their aspects, the dharmas from the applications of mindfulness, up to, at the end, “the distinct attributes of a buddha” are the Great Vehicle.

source: དེ་དག་ལ་ཡང་རྣམ་པ་ཐམས་ཅད་དུ་བསྒོམ་པར་བརྩོན་པ་དག་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་གསུམ་པ་སྟེ། དེ་ཡང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ། །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: And again, the third is that those working hard at meditating on them in all their aspects have set out in the Great Vehicle, thus it again says, “That, Venerable Śāriputra, is the bodhisattva great beings’ Great Vehicle, and in that way bodhisattva great beings have set out in the Great Vehicle.”

source: །དེ་ནས་ཡང་ཚད་མེད་པ་བཞི་ལ་བསྒོམས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། མདོ་ལས་འབྱུང་བ་བཞིན་དུ་དེ་ལ་བརྩོན་པ་དག་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་བཞི་པའོ།
en: Then the fourth is where it says the two—meditation on the immeasurables and the six perfections—is the Great Vehicle and those working hard at those as explained in the Sūtra are those who have set out.

source: །དེ་ནས་ཡང་སྟོང་པ་ཉིད་བཅུ་དྲུག་ནི་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། དེ་ཡང་མི་དམིགས་པར་ཡིད་ལ་བྱེད་པ་དག་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ལྔ་པའོ།
en: Then the fifth is where it says the sixteen emptinesses are the Great Vehicle and those who pay attention to them without apprehending them are those who have set out.

source: །དེ་ནས་མི་གཡེང་ཞིང་མཉམ་པར་གཞག་པ་དག་ཐེག་པ་ཆེན་པོའི་ཡིན་པ་དང་། དེ་ཤེས་པ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་དྲུག་པའོ།
en: Then the sixth is where it says unscattered meditative equipoises are the Great Vehicle and those who know them are those who have set out.

source: །གཡེང་བ་དང་ཏིང་ངེ་འཛིན་དང་མཚན་མ་དང་བཅས་པར་དམིགས་པར་གནས་པ་ལ་ཡོད་ཀྱི་མཚན་མ་མེད་པ་ལ་ནི་མ་ཡིན་ཏེ། རྣམ་པར་མི་རྟོག་པ་ལ་གནས་པ་ནི་རྟག་ཏུ་མཉམ་པར་གཞག་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that when abiding in apprehending scattering and meditative stabilization together with causal signs, not signlessness, abiding without thought construction is always meditative equipoise.

source: །དེ་ནས་ཡང་གཉིས་སུ་མེད་པའི་ཆོས་ཉིད་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། དེ་ལ་ཤེས་པ་དང་མི་ཤེས་པ་མེད་པར་གྱུར་པ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་བདུན་པའོ།
en: Then the seventh is where it says the nondual true nature of dharmas is the Great Vehicle and those who neither know nor not know that are those who have set out.

source: །དེ་ནས་ཡང་དུས་གསུམ་མཉམ་པ་ཉིད་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། དེ་ལ་མི་ཤེས་པ་མེད་པ་དང་། མི་དམིགས་པའི་ཤེས་པ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་བརྒྱད་པའོ།
en: Then the eighth is where it says the sameness of the three time periods is the Great Vehicle, and those not without knowledge of them and with nonapprehending knowledge are those who have set out.

source: །དེ་ནས་ཡང་ཁམས་གསུམ་མཉམ་པ་ཉིད་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། དེ་ལ་མི་ཤེས་པ་མེད་པ་དང་། ཤེས་པ་མི་དམིགས་པ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་དགུ་པའོ།
en: Then the ninth is where it says the sameness of the three realms is the Great Vehicle, and those not without knowledge of them and with nonapprehending knowledge are those who have set out.

source: །དེ་ནས་ཡང་ཆོས་ཐམས་ཅད་ཐེག་པ་ཆེན་པོ་ཡིན་པ་དང་། དེ་ལ་ཤེས་པ་མི་དམིགས་པ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་བཅུ་པའོ།
en: And then the tenth is where it says all dharmas are the Great Vehicle and those who do not apprehend a knower of them are those who have set out.

source: །དེ་དག་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ། །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བྱ་བས་མཇུག་བསྡུས་སོ།། །།བམ་པོ་བཅུ་གཅིག་པ།
en: Having completed those, it sums up in conclusion with, “That, Venerable Śāriputra, is the bodhisattva great beings’ Great Vehicle, and in that way bodhisattva great beings have set out in the Great Vehicle.”

source: ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་གནས་ཞེས་བྱ་ཞེས་བྱ་བ་བཤད་དོ།
en: How do they stand in the Great Vehicle? Now to pose the third question it says, “Venerable Pūrṇa, to what extent does a bodhisattva great being stand in the Great Vehicle?”

source: །དེ་ནས་གནས་བརྟན་གང་པོས་ས་བརྒྱད་པ་ཡན་ཆད་རྣམ་པར་མི་རྟོག་པ་ལ་སྤྱོད་པ་དྲུག་བསྟན་ལ།
en: The elder Pūrṇa then gives an exposition of six nonconceptual practices from the eighth level on up. “

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་གནས་ཞེས་བྱ་བ་ལ་སོགས་པས་རྣམ་པར་མི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གནས་སྐབས་དང་པོ་བསྟན་ཏོ།
en: Venerable Śāriputra, here when bodhisattva great beings are practicing the perfection of wisdom they mount up on the perfection of giving,” and so on, teaches the first stage of nonconceptual perfection without thought construction.

source: །རྣམ་པར་མི་རྟོག་པའི་སྟོང་པ་ཉིད་བསྒོམ་པ་ནི་གཉིས་པའོ། །རྣམ་པར་མི་རྟོག་པར་དཀར་པོའི་ཆོས་ཐམས་ཅད་བསྒོམས་པ་ནི་གསུམ་པའོ། །ཆོས་ཐམས་ཅད་མི་དམིགས་པ་ནི་བཞི་པའོ། །དབང་གི་གནས་སྐབས་ནི་ལྔ་པའོ། །མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ནི་དྲུག་པའོ།
en: Nonconceptual meditation on emptiness is the second, nonconceptual meditation on all bright dharmas the third, all dharmas that cannot be apprehended the fourth, the stage of control the fifth, and complete awakening the sixth.

source: །དེ་ལ་དང་པོར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཞེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པ་དང་བཅས་པར་སྤྱོད་པའི་ས་ནས་རྣམ་པར་མི་རྟོག་པ་རྣམ་པར་སྨིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གནས་ལ་གནས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There, the first is they “stand in the perfection of giving.” This means they stand up on a place—a maturation without conceptualization—that is a perfection beyond the level of conceptual practice.

source: །ས་བརྒྱད་པ་ལ་ནི་རྣམ་པར་རྟོག་པ་དང་བཅས་པ་དང་། རྩོལ་བ་དང་བཅས་པའི་བསོད་ནམས་ཀྱི་ཚོགས་སྔོན་དུ་ཡོངས་སུ་རྫོགས་པར་བྱས་པའི་འབྲས་བུར་གྱུར་པ་རྣམ་པར་སྨིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་རྩོལ་བ་མེད་པར་ཡང་ཉེ་བར་གནས་ཏེ།
en: At the eighth level they have arrived at effortless perfections that are maturation results that have come about from having earlier completed, with conceptualization and with effort, the accumulation of merits.

source: འབྲས་བུའི་བདག་ཉིད་དུ་གྱུར་པའི་ཕྱིར་རྣམ་པར་མི་རྟོག་པ་ཡིན་ནོ།
en: They have come about in the form of a result so they are nonconceptual.

source: །དེ་དག་དང་ཐབས་མཁས་པའི་མཐུ་དང་། སྨོན་ལམ་གྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་གྱི་དོན་སྒྲུབ་པོ།
en: Bodhisattvas accomplish the welfare of beings through those, through the power of skillful means, and through the power of prayer that is a vow.

source: །གཉིས་པ་ལ་ནི། བསྒོམ་པ་རྣམ་པར་གཞིག་པའི་ཕྱིར་ན་སྟོང་པ་ཉིད་བསྒོམ་མོ་ཞེས་བྱ་བ་ལ།
en: Second, it says they “meditate on… emptiness… because of the investigation of the meditation.”

source: རྣམ་པར་འཇིག་པ་ཞེས་བྱ་བ་ནི་འདིར་སྟོང་པར་བྱེད་པ་ལ་བྱ་སྟེ།
en: Take “disintegration of the meditation” here as making it empty.

source: རྣམ་པར་འཇིག་པ་བསྒོམས་པས་མི་དམིགས་པར་བསྒོམ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: What it means is by meditating on disintegration they meditate without apprehending anything.

source: །དངོས་པོ་མེད་པར་བྱེད་པ་ཉིད་ལ་འདིར་བསྒོམ་པ་ཞེས་བྱའོ།
en: They “meditate” on this, on just this turning it into a nonexistent thing.

source: །ལྷག་མ་ནི་གོ་སླའོ།
en: The rest are easy to understand.

source: །དེ་ལྟར་གནས་བརྟན་གང་པོས་རང་གི་སྤོབས་པ་བསྟན་པ་དང་། གནས་བརྟན་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་དགོངས་པ་ཤེས་པར་འདོད་ནས། བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་ཞེས་བགྱི་བ་ལགས་ཞེས་བཅོམ་ལྡན་འདས་ལ་ཞུས་སོ།
en: The elder Pūrṇa having thus demonstrated his confidence and readiness to speak, the elder Subhūti, wanting to understand the Lord’s intention, inquires, “Lord, to what extent are bodhisattva great beings armed with great armor?”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་གོ་ཆ་ཆེན་པོ་རྣམ་པ་དགུ་བསྟན་ཏོ།
en: Having been asked that, the Lord teaches the ninefold great armor.

source: །དེའི་འོག་ཏུ་དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་བདག་གི་སྤོབས་པ་གཉིས་པ་བསྟན་པ་དང་འགྲེས་བཅུ་གཅིག་གིས་བསྟན་ཏེ།
en: After that, then the elder Subhūti demonstrates his two confidences and readinesses to speak, and there is an explanation in eleven sections of the text.

source: གོ་ཆ་ཐམས་ཅད་བགོས་པ་རྣམས་ཀྱི་ནང་ནས་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་རྫུ་འཕྲུལ་གྱི་ངན་འགྲོ་རབ་ཏུ་ཞི་བར་བྱེད་པའི་འགྲེས་སྒྱུ་མ་ལྟ་བུ་དང་བཅས་པའི་འགྲེས་ནི་དང་པོའོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་འགྲེས་སྒྱུ་མ་ལྟ་བུ་དྲུག་གོ། །ཕྱོགས་བཅུའི་སེམས་ཅན་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བཀོད་པ་སྒྱུ་མ་ལྟ་བུ་ནི་བརྒྱད་པའོ། །བསམ་པ་རྒྱ་ཆེན་པོ་ནི་དགུ་པའོ།
en: From among those armed with all the armor, the section of the text on extinguishing bad forms of life with maturation-based magical power, together with the section on them being conjured up, is the first; the six sections on the six perfections are the six that are like things that have been conjured up; conjuring up establishing beings in the ten directions in the six perfections is the eighth; and the vast intention is the ninth.

source: །དེ་ལ་གནས་བརྟན་གྱིས་སྒྱུ་མ་ལྟ་བུའི་རྒྱུས་བདག་གི་སྤོབས་པ་བསྐྱེད་པར་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན་ཞེས་བྱ་བ་གསུངས་སོ།
en: Then the elder Subhūti, to demonstrate that he has generated a confidence and readiness to speak about that on account of an illusion-like cause, says, “The way I understand what you, Lord, have said…” As for, “Oh!

source: །ཀྱེ་མ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གོ་ཆ་མ་མཆིས་པའི་གོ་ཆ་བགོས་པར་རིག་པར་བགྱིའོ་ཞེས་བྱ་བ་ནི་སྔར་བཤད་པའི་གོ་ཆ་ཐམས་ཅད་ཀུན་བརྟགས་པ་ཡིན་པའི་ཕྱིར་གོ་ཆ་དེ་དག་ཀྱང་མེད་པའི་རང་བཞིན་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་གོ་ཆ་བགོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Those bodhisattva great beings should be understood to be armed with no armor,” this means that because all the armor that has been explained before is falsely imagined, bodhisattva great beings are armed with an armor that has the nonexistence of an intrinsic nature, suchness, for its intrinsic nature.

source: །དེ་བས་ན་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ནས་ཞེས་བྱ་བ་གསོལ་ཏོ།
en: Therefore, he says “because all dharmas, given the illusory nature of dharmas, are empty of their own mark.”

source: །སྒྱུ་མའི་ཆོས་དེ་དག་བསྒྲུབ་པའི་ཕྱིར། གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་དེ།
en: To establish that they are illusory phenomena, it says “form is empty of form” and so on.

source: འདི་ལྟར་ཡོངས་སུ་གྲུབ་པའི་གཟུགས་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱིས་སྟོང་ཞིང་། ཡོངས་སུ་གྲུབ་པའི་ཚོར་བ་ཀུན་བརྟགས་པའི་ཚོར་བས་སྟོང་སྟེ། དེའི་ཕྱིར་དོན་དམ་པའི་གོ་ཆ་ཡང་ཀུན་བརྟགས་པའི་གོ་ཆས་སྟོང་ངོ་ཞེས་བྱ་བར་སྦྱར་རོ།
en: This connects thoroughly established form being empty of falsely imagined form, and thoroughly established feeling being empty of falsely imagined feeling, with “therefore ultimate armor is empty of falsely imagined armor.”

source: །དེ་བས་ན་ཐ་མར། གོ་ཆ་ཆེན་པོ་ཡང་གོ་ཆ་ཆེན་པོས་སྟོང་སྟེ།
en: Therefore at the end it says “great armor is empty of great armor.

source: བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་མ་མཆིས་པའི་གོ་ཆ་བགོས་པར་རིག་པར་བགྱིའོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: I understand that bodhisattva great beings are armed with no armor, Lord, through this one of many explanations.”

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་མ་བྱས་མ་བཤིག་མངོན་པར་འདུས་མ་བྱས་ཞེས་བྱ་བ་ཅི་ལས་དགོངས་ཤེ་ན།
en: What is the intention where it says, “Subhūti, the knowledge of all aspects is not made, is not unmade, and does not occasion anything”?

source: འཇིག་རྟེན་འདི་ན་གོ་ཆ་ནི་རྣམ་པ་གསུམ་དུ་འཇུག་སྟེ། ཅི་ཞིག་བྱའོ་སྙམ་ནས་གོ་ཆ་གྱོན་པར་བྱེད་དེ།
en: In this world protective equipment refers to three things: Thinking, “What needs to be done?” you wear protective clothing.

source: དཔེར་ན་བདག་གི་གྲོང་ཁྱེར་བརྩིག་གོ་སྙམ་མམ། གཙུག་ལག་ཁང་བརྩིག་གོ་ཞེས་བྱ་བ་ལྟ་བུ་དང་།
en: To illustrate, you think, “I will build a town” or “I will build a temple.”

source: ཅི་ཞིག་མེད་པར་བྱའོ་སྙམ་ནས།
en: Thinking, “What should I destroy?”

source: གོ་ཆ་གྱོན་པར་བྱེད་དེ།
en: you put on armor.

source: དཔེར་ན་བདག་གིས་གྲོང་ཁྱེར་གཞིག་པར་བྱའོ་ཞེས་བྱ་བ་འམ། གྲོང་ཁྱེར་གཞིག་པར་བྱའོ་ཞེས་བྱ་བ་ལྟ་བུ་དང་།
en: For example, you think, “I will destroy the town” or “I will destroy the temple.”

source: ཅི་ཞིག་མངོན་པར་འདུ་བྱའོ་སྙམ་ནས་གོ་ཆ་གྱོན་པར་བྱེད་དེ།
en: Thinking, “To what should I give an occasion?” you put on protective equipment.

source: དཔེར་ན་བདག་གིས་གྲོང་ཉམས་དགའ་བར་བྱའོ་སྙམ་མམ། གྲོང་ཁྱེར་ལེགས་པར་བྱའོ་སྙམ་དུ་སེམས་པ་ལྟ་བུའོ།
en: To illustrate, you think, “I will enjoy the town” or “I will clean the town.”

source: །དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གལ་ཏེ་འགའ་ཞིག་གིས་བྱས་པ་འམ།
en: It is similar with the knowledge of all aspects as well.

source: གཞིག་པའམ། མངོན་པར་འདུ་བྱ་བ་ཞིག་ཡིན་ན་ནི་དེ་ལྟ་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དོན་དུ་གོ་ཆ་ཆེན་པོ་བགོས་པར་འགྱུར་བ་ཞིག་ན།
en: Someone may have become armed with great armor for the purpose of the knowledge of all aspects that is made, or destroyed, or given an occasion like that.
